In [1]:
import pandas as pd

In [2]:
#merge(df1,df2):두 데이터프레임에 동일한 이름을 가진 컬럼을 기준으로 두 데이터프레임을 합친다.

In [42]:
df1=pd.DataFrame({'name':['a','b','c','d'],'bachelor':['Business','IT','Accounting','Marketing']})
df1

  name    bachelor
0    a    Business
1    b          IT
2    c  Accounting
3    d   Marketing

In [4]:
df2=pd.DataFrame({'name':['a','b','c','d'],'year':['2019','2020','2021','2022']})
df2

  name  year
0    a  2019
1    b  2020
2    c  2021
3    d  2022

In [6]:
df3=pd.merge(df1,df2) #중복된 컬럼 name을 기준으로하여 병합한다.
df3

  name    bachelor  year
0    a    Business  2019
1    b          IT  2020
2    c  Accounting  2021
3    d   Marketing  2022

In [7]:
df3=pd.merge(df1,df2,on='name') #on을 이용해서 병합할 컬럼을 명시한다
df3

  name    bachelor  year
0    a    Business  2019
1    b          IT  2020
2    c  Accounting  2021
3    d   Marketing  2022

In [8]:
df4=pd.DataFrame({'bachelor':['Business','IT','Accounting','Marketing'],'unit_code':[1,2,3,4]})
df4

     bachelor  unit_code
0    Business          1
1          IT          2
2  Accounting          3
3   Marketing          4

In [10]:
pd.merge(df3,df4,on='bachelor') #bachelor 컬럼을 기준으로 merge

  name    bachelor  year  unit_code
0    a    Business  2019          1
1    b          IT  2020          2
2    c  Accounting  2021          3
3    d   Marketing  2022          4

In [11]:
df5=pd.DataFrame({'bachelor':['Business','IT','Accounting','Accounting','Management','Management'],
                 'unit':['Fundamental_businee','programming','Fundamental','real_accounting','sports management','Fundamental management']})

            
df5

     bachelor                    unit
0    Business     Fundamental_businee
1          IT             programming
2  Accounting             Fundamental
3  Accounting         real_accounting
4  Management       sports management
5  Management  Fundamental management

In [12]:
pd.merge(df1,df5,on='bachelor')

  name    bachelor                 unit
0    a    Business  Fundamental_businee
1    b          IT          programming
2    c  Accounting          Fundamental
3    c  Accounting      real_accounting

In [13]:
# merge의 상세한 기능
# merge(df1,df2,how=결합방법)

In [14]:
# inner-내부조인
# on의 컬럼값이 두 데이터프레임에서 동일한 행 찾기
# 각 동일한 행의 컬럼/컬럼값만 가져오기

In [15]:
df1 = pd.DataFrame({
    'id': [1, 2, 3],
    'customer_id': [4, 5, 6],
    'customer_name': ['Lucas', 'James', 'John']
}, columns=['id', 'customer_id', 'customer_name'])
df1

   id  customer_id customer_name
0   1            4         Lucas
1   2            5         James
2   3            6          John

In [16]:
df2 = pd.DataFrame({
    'id': [1, 2, 4],
    'order_id': [50, 100, 150],
    'order_date': ['2022-05-05', '2021-06-07', '2022-07-31']
}, columns=['id', 'order_id', 'order_date'])
df2

   id  order_id  order_date
0   1        50  2022-05-05
1   2       100  2021-06-07
2   4       150  2022-07-31

In [17]:
pd.merge(df1,df2,on='id') #inner가 default이므로 따로 명시하지 않아도 된다.

   id  customer_id customer_name  order_id  order_date
0   1            4         Lucas        50  2022-05-05
1   2            5         James       100  2021-06-07

In [18]:
pd.merge(df1,df2,on='id',how='inner')

   id  customer_id customer_name  order_id  order_date
0   1            4         Lucas        50  2022-05-05
1   2            5         James       100  2021-06-07

In [19]:
# outer join
# 각 동일한 행의 컬럼/컬럼값을 가져와 붙인다음에
# 각각 데이터프레임의 나머지 행의 컬럼/컬럼값을 가져와 별도 행으로 붙인다.
# 컬럼값이 없을 경우 데이이터가 없다는 뜻인 NaN으로 표시된다.

In [20]:
pd.merge(df1,df2,on='id',how='outer')

   id  customer_id customer_name  order_id  order_date
0   1          4.0         Lucas      50.0  2022-05-05
1   2          5.0         James     100.0  2021-06-07
2   3          6.0          John       NaN         NaN
3   4          NaN           NaN     150.0  2022-07-31

In [21]:
# left join (왼쪽 우선 외부조인)
# 왼쪽 데이터프레임의 행을 모두 가져온다.
# 왼쪽 데이터프레임의 행에 있는 on의 컬럼값이 동일한 오른쪽 데이터프레임의 컬럼과 행을 가져와 연결한다.
# 오른쪽 데이터프레임에 없는 on의 컬럼값을 가진 왼쪽 데이터프레임의 오른쪽 데이터프레임 컬럼들에는 데이터 없음을 표시한다.(NaN)

pd.merge(df1,df2,on='id',how='left')

   id  customer_id customer_name  order_id  order_date
0   1            4         Lucas      50.0  2022-05-05
1   2            5         James     100.0  2021-06-07
2   3            6          John       NaN         NaN

In [22]:
# right join(오른쪽 우선 외부조인)
# 오른쪽 데이터프레임의 행을 모두 가져오기
# 오른쪽 데이터프레임의 행에 있는 on의 컬럼값이 동일한 왼쪽 데이터프레임의 행만 컬럼과 함께 가져와 붙이기
# 왼쪽 데이터프레임에 없는 on의 컬럼값을 가진 오른쪽 데이터프레임의 왼쪽 데이터프레임 컬럼들에는 데이터 없음(NaN)으로 표기하기

In [23]:
pd.merge(df1,df2,on='id',how='right')

   id  customer_id customer_name  order_id  order_date
0   1          4.0         Lucas        50  2022-05-05
1   2          5.0         James       100  2021-06-07
2   4          NaN           NaN       150  2022-07-31

In [24]:
# left_on과 right_on
# left_on: 조인키로 사용할 left dataframe 컬럼
# right_on: 조인키로 사용할 right dataframe 컬럼

In [26]:
df1=df1=pd.DataFrame({'name':['a','b','c','d'],'bachelor':['Business','IT','Accounting','Marketing']})
df1

  name    bachelor
0    a    Business
1    b          IT
2    c  Accounting
3    d   Marketing

In [28]:
df6=pd.DataFrame({'student':['a','b','c','d'],'marks':[70,90,80,100]})
df6

  student  marks
0       a     70
1       b     90
2       c     80
3       d    100

In [29]:
pd.merge(df1,df6,left_on='name',right_on='student')

  name    bachelor student  marks
0    a    Business       a     70
1    b          IT       b     90
2    c  Accounting       c     80
3    d   Marketing       d    100

In [ ]:
# 병합하려는 키가 데이터프레임의 색인일 경우 사용
# left_index: 조인키로 사용할 left DataFrame의 색인 로우 (다중 색인일 경우 키)
# right_index: 조인키로 사용할 right DataFrame의 색인 로우 (다중 색인일 경우 키)

In [31]:
left_1=pd.DataFrame({'class':[1,3,2,2],
                    'marks':[85,95,92,84]})
left_1

   class  marks
0      1     85
1      3     95
2      2     92
3      2     84

In [33]:
right_1=pd.DataFrame({'Average':[85,90]},
                    index=[1,2])
right_1

   Average
1       85
2       90

In [36]:
pd.merge(left_1,right_1,left_on='class',right_index=True)

   class  marks  Average
0      1     85       85
2      2     92       90
3      2     84       90

In [37]:
# suffixes기능
# 컬럼 이름이 겹칠경우 각 컬럼 이름 뒤에 붙일 문자열의 튜플

In [38]:
df9=pd.DataFrame({'name':['a','b','c','d'],'rank':[3,1,2,4]})
df9

  name  rank
0    a     3
1    b     1
2    c     2
3    d     4

In [39]:
df10=pd.DataFrame({'name':['a','b','c','d'],'rank':[1,2,3,4]})
df10

  name  rank
0    a     1
1    b     2
2    c     3
3    d     4

In [40]:
pd.merge(df9,df10,on='name',suffixes=['_math','_science'])

  name  rank_math  rank_science
0    a          3             1
1    b          1             2
2    c          2             3
3    d          4             4